public/programming/notes/programming-advice.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<link rel="icon" href="/giovanni-diary/favicon.ico" type="image/x-icon">
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../index.html">Giovanni's Diary</a> &gt; <a href="../../subjects.html">Subjects</a> &gt; <a href="../programming.html">Programming</a> &gt; <a href="notes.html">Notes</a> &gt;
</p>
<div id="outline-container-orgfdf35d1" class="outline-2">
<h2 id="orgfdf35d1">Programming advice</h2>
<div class="outline-text-2" id="text-orgfdf35d1">
<p>
There are some basic principles and ideas that you really understand
only after years of experience, and knowing them earlier would have
been really beneficial and would have not wasted a lot of time.
</p>

<p>
Here is a collection of key things I have learned over the years. They
are particularly relevant for me, because of my background and how I
think, but I think anyone can get some values out of them.
</p>
</div>
<div id="outline-container-org8785cc7" class="outline-3">
<h3 id="org8785cc7">Have Fun and explore ideas</h3>
<div class="outline-text-3" id="text-org8785cc7">
<p>
This is the most important thing in order to keep going on programming
and improving without serious burnouts. Especially if your job is
boring and stressful, programming on your free time can be really fun
and can motivate you in your actual job. Practice <a href="recreational-programming.html">recreatinoal
programming</a>, as a lifestyle or not.
</p>

<p>
I struggled a lot with this in my early programming years. Since I am
historically an anxious person always concearned about its future,
programming "for fun" and programming for "my sustainable future"
where two completaly separate things, and I would often discard the
former. I liked learning about algorithms and programming languages,
don't get me wrong, but I was constantly thinking about "this may help
me to get a job" or "this is useless to get a job, so I should focus
elsewhere".
</p>

<p>
A second error I did early on was to think too much about certain
technologies being "the best". There are certain communities, which I
now think are quite toxic and stay away from them, that threat their
favourite program as their religion. Examples include Linux
distributions like Nixos, programming languages in particular Rust,
and editing software like Vim. This only makes you incredibly limited,
biased and, frankly, stupid.
</p>

<p>
Eventually I matured (if you can say so) out of this mentality and
started exploring my ideas and anything what I would find
interesting. From <a href="https://github.com/San7o/Brenta-Engine">game engines</a> to <a href="https://github.com/San7o/haplolang/">programming languages</a>, I started
writing so many things, discovering new worlds, programming day and
night until my body could not type anymore. Through this constant
practice I exercised how to work and create software of any kind,
which is very useful for "my sustainable future" by the way, and I
felt like I was learning naturally.
</p>

<p>
A related advice would be to <a href="start-projects.html">do a lot of projects</a> in many different
areas. This is how you become a well-rounded programmer able to solve
all kinds of problems.
</p>
</div>
</div>
<div id="outline-container-orgc4b9b78" class="outline-3">
<h3 id="orgc4b9b78">Write things from scratch</h3>
<div class="outline-text-3" id="text-orgc4b9b78">
<p>
There is no better way to learn something than to write it from
scratch. While this may not be the best advice for the day to day job
(it is totally fine to use someonelse's code), I belive it is
incredibly benecificial for educational purposes. Try to go as low
level as possible (phisically or logically), master the basics and you
will be able to write anything.
</p>

<p>
This is one of the reasons why I still program mostly in C. I want to
be used to setting up compilation and linking, to manage menory, etc,
because this is how you understand how the computer works. I may be
really stupid, but for me theory is not enough and I need lots of
practice to truly understand something and be able to fully take
advantage of a technology.
</p>
</div>
</div>
<div id="outline-container-org28d2d72" class="outline-3">
<h3 id="org28d2d72">Write easily (re)usable software</h3>
<div class="outline-text-3" id="text-org28d2d72">
<p>
Understanding this and applying it in anything that I do made me a way
better programmer. Everytime you have write some functionality for
your projects, think about how this can be extracted out of the
project and be its own thing. Eventually, for new projects you will
have already wrote most of the code in the past, and you can just
reuse it.
</p>

<p>
I want to emphasize the term "easy". Apis should be simple and clear,
as the creator of Perl Larry Wall said "Easy things should be easy,
hard things should be possible". The best examples are the <a href="https://github.com/nothings/stb">stb
libraries</a> or my own <a href="https://github.com/San7o/micro-headers">micro-headers</a>, which can be integrated in your
projects just by copy-pasting a single header file. This is the level
of reusability you should aim for.
</p>

<p>
If your code is easy to read, it is more understandable by other
programmers, more maintainable and customizable.
</p>

<hr />

<p>
Travel: <a href="notes.html">Programming Notes</a>, <a href="../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
